{"format": "graph-model", "generatedBy": "2.2.0", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "userDefinedMetadata": {"signature": {"outputs": {"PFLD/sigmoid": {"name": "PFLD/sigmoid"}}}}, "modelTopology": {"node": [{"name": "PFLD/S1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PFLD/S1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PFLD/S1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PFLD/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PFLD/FC/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1664"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/FC/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, {"name": "PFLD/Conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "PFLD/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "4"}, {"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}}}, {"name": "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "PFLD/Conv3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv1ReLU6", "op": "_FusedConv2D", "input": ["input", "PFLD/Conv1/Conv2D_weights", "PFLD/Conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PFLD/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Conv1ReLU6", "PFLD/DepthwiseConv/depthwise_weights", "PFLD/DepthwiseConv/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_1/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/DepthwiseConv/depthwise", "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "PFLD/Bottleneck1_1/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck1_1/Pointwise1ReLU6", "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_1/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_1/DepthwiseConv/depthwise", "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PFLD/Bottleneck1_2/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_1/Pointwise2BN/FusedBatchNorm", "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_2/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck1_2/Pointwise1ReLU6", "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_2/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_2/DepthwiseConv/depthwise", "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PFLD/Bottleneck1_2/add", "op": "Add", "input": ["PFLD/Bottleneck1_1/Pointwise2BN/FusedBatchNorm", "PFLD/Bottleneck1_2/Pointwise2BN/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_3/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_2/add", "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PFLD/Bottleneck1_3/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck1_3/Pointwise1ReLU6", "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_3/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_3/DepthwiseConv/depthwise", "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}}}, {"name": "PFLD/Bottleneck1_3/add", "op": "Add", "input": ["PFLD/Bottleneck1_2/add", "PFLD/Bottleneck1_3/Pointwise2BN/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck1_4/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_3/add", "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_4/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck1_4/Pointwise1ReLU6", "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_4/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_4/DepthwiseConv/depthwise", "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PFLD/Bottleneck1_5/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_4/Pointwise2BN/FusedBatchNorm", "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/Bottleneck1_5/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck1_5/Pointwise1ReLU6", "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_bn_offset"], "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "PFLD/Bottleneck1_5/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_5/DepthwiseConv/depthwise", "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PFLD/Bottleneck1_5/add", "op": "Add", "input": ["PFLD/Bottleneck1_4/Pointwise2BN/FusedBatchNorm", "PFLD/Bottleneck1_5/Pointwise2BN/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Bottleneck4_1/Pointwise1ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck1_5/add", "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_weights", "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "PFLD/Bottleneck4_1/DepthwiseConv/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["PFLD/Bottleneck4_1/Pointwise1ReLU6", "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_weights", "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_bn_offset"], "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PFLD/Bottleneck4_1/Pointwise2BN/FusedBatchNorm", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck4_1/DepthwiseConv/depthwise", "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_weights", "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "PFLD/Bottleneck4_1/add", "op": "Add", "input": ["PFLD/Bottleneck1_5/add", "PFLD/Bottleneck4_1/Pointwise2BN/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PFLD/Conv2ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Bottleneck4_1/add", "PFLD/Conv2/Conv2D_weights", "PFLD/Conv2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PFLD/S1/Shape", "op": "Shape", "input": ["PFLD/Bottleneck4_1/add"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PFLD/S2/Shape", "op": "Shape", "input": ["PFLD/Conv2ReLU6"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PFLD/Conv3ReLU6", "op": "_FusedConv2D", "input": ["PFLD/Conv2ReLU6", "PFLD/Conv3/Conv2D_weights", "PFLD/Conv3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "PFLD/S1/strided_slice", "op": "StridedSlice", "input": ["PFLD/S1/Shape", "PFLD/S1/strided_slice/stack", "PFLD/S1/strided_slice/stack_1", "PFLD/S1/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PFLD/S2/strided_slice", "op": "StridedSlice", "input": ["PFLD/S2/Shape", "PFLD/S1/strided_slice/stack", "PFLD/S1/strided_slice/stack_1", "PFLD/S1/strided_slice/stack_1"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "PFLD/S3/Shape", "op": "Shape", "input": ["PFLD/Conv3ReLU6"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "PFLD/S1/Reshape/shape", "op": "Pack", "input": ["PFLD/S1/strided_slice", "PFLD/S1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PFLD/S2/Reshape/shape", "op": "Pack", "input": ["PFLD/S2/strided_slice", "PFLD/S1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PFLD/S3/strided_slice", "op": "StridedSlice", "input": ["PFLD/S3/Shape", "PFLD/S1/strided_slice/stack", "PFLD/S1/strided_slice/stack_1", "PFLD/S1/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "PFLD/S1/Reshape", "op": "Reshape", "input": ["PFLD/Bottleneck4_1/add", "PFLD/S1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PFLD/S2/Reshape", "op": "Reshape", "input": ["PFLD/Conv2ReLU6", "PFLD/S2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PFLD/S3/Reshape/shape", "op": "Pack", "input": ["PFLD/S3/strided_slice", "PFLD/S1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "PFLD/S3/Reshape", "op": "Reshape", "input": ["PFLD/Conv3ReLU6", "PFLD/S3/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PFLD/concat", "op": "ConcatV2", "input": ["PFLD/S1/Reshape", "PFLD/S2/Reshape", "PFLD/S3/Reshape", "PFLD/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "PFLD/FC/BiasAdd", "op": "_FusedMatMul", "input": ["PFLD/concat", "PFLD/FC/kernel", "PFLD/FC/bias"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "PFLD/sigmoid", "op": "Sigmoid", "input": ["PFLD/FC/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PFLD/S1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "PFLD/S1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "PFLD/S1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "PFLD/concat/axis", "shape": [], "dtype": "int32"}, {"name": "PFLD/FC/kernel", "shape": [1664, 1], "dtype": "float32"}, {"name": "PFLD/FC/bias", "shape": [1], "dtype": "float32"}, {"name": "PFLD/Conv1/Conv2D_weights", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "PFLD/Conv1/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/DepthwiseConv/depthwise_weights", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "PFLD/DepthwiseConv/depthwise_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Conv2/Conv2D_weights", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_1/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Conv2/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_2/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_3/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Conv3/Conv2D_weights", "shape": [4, 4, 32, 128], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_4/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Conv3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck1_5/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_weights", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/Pointwise1Conv/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_weights", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/DepthwiseConv/depthwise_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_weights", "shape": [1, 1, 32, 16], "dtype": "float32"}, {"name": "PFLD/Bottleneck4_1/Pointwise2Conv/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}]}]}